{
  "__inputs": [
    {
      "name": "DS_AZURE_MONITOR",
      "label": "Azure Monitor",
      "description": "",
      "type": "datasource",
      "pluginId": "grafana-azure-monitor-datasource",
      "pluginName": "Azure Monitor"
    }
  ],
  "__elements": {},
  "__requires": [
    {
      "type": "panel",
      "id": "barchart",
      "name": "Bar chart",
      "version": ""
    },
    {
      "type": "panel",
      "id": "bargauge",
      "name": "Bar gauge",
      "version": ""
    },
    {
      "type": "panel",
      "id": "gauge",
      "name": "Gauge",
      "version": ""
    },
    {
      "type": "grafana",
      "id": "grafana",
      "name": "Grafana",
      "version": "11.6.2"
    },
    {
      "type": "datasource",
      "id": "grafana-azure-monitor-datasource",
      "name": "Azure Monitor",
      "version": "11.6.2"
    },
    {
      "type": "panel",
      "id": "stat",
      "name": "Stat",
      "version": ""
    },
    {
      "type": "panel",
      "id": "table",
      "name": "Table",
      "version": ""
    },
    {
      "type": "panel",
      "id": "text",
      "name": "Text",
      "version": ""
    },
    {
      "type": "panel",
      "id": "timeseries",
      "name": "Time series",
      "version": ""
    }
  ],
  "annotations": {
    "list": [
      {
        "builtIn": 1,
        "datasource": {
          "type": "grafana",
          "uid": "-- Grafana --"
        },
        "enable": true,
        "hide": true,
        "iconColor": "rgba(0, 211, 255, 1)",
        "name": "Annotations & Alerts",
        "type": "dashboard"
      }
    ]
  },
  "editable": true,
  "fiscalYearStartMonth": 0,
  "graphTooltip": 0,
  "id": null,
  "links": [],
  "panels": [
    {
      "gridPos": {
        "h": 2,
        "w": 23,
        "x": 0,
        "y": 0
      },
      "id": 10,
      "options": {
        "code": {
          "language": "plaintext",
          "showLineNumbers": false,
          "showMiniMap": false
        },
        "content": "# GraphApi utilization Dashboard\n",
        "mode": "markdown"
      },
      "pluginVersion": "11.6.2",
      "type": "text"
    },
    {
      "datasource": {
        "type": "grafana-azure-monitor-datasource",
        "uid": "${DS_AZURE_MONITOR}"
      },
      "fieldConfig": {
        "defaults": {
          "color": {
            "mode": "thresholds"
          },
          "mappings": [],
          "min": 0,
          "noValue": "No throttle events detected",
          "thresholds": {
            "mode": "absolute",
            "steps": [
              {
                "color": "green"
              }
            ]
          },
          "unit": "none"
        },
        "overrides": []
      },
      "gridPos": {
        "h": 9,
        "w": 13,
        "x": 0,
        "y": 2
      },
      "id": 9,
      "options": {
        "colorMode": "value",
        "graphMode": "area",
        "justifyMode": "auto",
        "orientation": "auto",
        "percentChangeColorMode": "standard",
        "reduceOptions": {
          "calcs": [
            "count"
          ],
          "fields": "",
          "values": false
        },
        "showPercentChange": true,
        "textMode": "auto",
        "wideLayout": true
      },
      "pluginVersion": "11.6.2",
      "targets": [
        {
          "azureLogAnalytics": {
            "basicLogsQuery": false,
            "dashboardTime": true,
            "query": "MicrosoftGraphActivityLogs\r\n| where AppId in (${AppId})\r\n| where ResponseStatusCode == 429\r\n//| where ResponseStatusCode == 500\r\n| summarize Count = count() by AppId , bin(TimeGenerated, 5m)\r\n| project TimeGenerated , AppId , Count\r\n| order by TimeGenerated asc  ",
            "resources": [
              "${LogAnalyticsWorkspaces}"
            ],
            "resultFormat": "time_series",
            "timeColumn": "TimeGenerated"
          },
          "datasource": {
            "type": "grafana-azure-monitor-datasource",
            "uid": "${DS_AZURE_MONITOR}"
          },
          "queryType": "Azure Log Analytics",
          "refId": "A"
        }
      ],
      "title": "GraphApi throttled by AppID",
      "type": "stat"
    },
    {
      "datasource": {
        "type": "grafana-azure-monitor-datasource",
        "uid": "${DS_AZURE_MONITOR}"
      },
      "fieldConfig": {
        "defaults": {
          "color": {
            "mode": "thresholds"
          },
          "custom": {
            "align": "left",
            "cellOptions": {
              "type": "auto"
            },
            "inspect": false
          },
          "mappings": [],
          "min": 0,
          "thresholds": {
            "mode": "absolute",
            "steps": [
              {
                "color": "green"
              }
            ]
          },
          "unit": "none"
        },
        "overrides": [
          {
            "matcher": {
              "id": "byName",
              "options": "TimeGenerated"
            },
            "properties": [
              {
                "id": "custom.width",
                "value": 169
              }
            ]
          },
          {
            "matcher": {
              "id": "byName",
              "options": "AppId"
            },
            "properties": [
              {
                "id": "custom.width",
                "value": 285
              }
            ]
          }
        ]
      },
      "gridPos": {
        "h": 9,
        "w": 10,
        "x": 13,
        "y": 2
      },
      "id": 11,
      "options": {
        "cellHeight": "sm",
        "footer": {
          "countRows": false,
          "fields": "",
          "reducer": [
            "sum"
          ],
          "show": false
        },
        "showHeader": true,
        "sortBy": []
      },
      "pluginVersion": "11.6.2",
      "targets": [
        {
          "azureLogAnalytics": {
            "basicLogsQuery": false,
            "dashboardTime": true,
            "query": "// Combine all sign-in tables into one set\r\nlet SignInApps = \r\n    union isfuzzy=true\r\n        (AADNonInteractiveUserSignInLogs | project AppId, AppDisplayName),\r\n        (AADManagedIdentitySignInLogs    | project AppId, ServicePrincipalName),\r\n        (AADServicePrincipalSignInLogs   | project AppId, ServicePrincipalName)\r\n    | summarize AppDisplayName = any(AppDisplayName), ServicePrincipalName = any(ServicePrincipalName) by AppId;\r\nMicrosoftGraphActivityLogs\r\n| where AppId in (${AppId})\r\n| where ResponseStatusCode == 429\r\n| join kind=leftouter SignInApps on AppId\r\n| extend applicationName = strcat(AppDisplayName, ServicePrincipalName)\r\n| summarize Count = count() by AppId, applicationName, bin(TimeGenerated, 5m)\r\n| project TimeGenerated, AppId, applicationName, Count\r\n| order by TimeGenerated asc",
            "resources": [
              "${LogAnalyticsWorkspaces}"
            ],
            "resultFormat": "table",
            "timeColumn": "TimeGenerated"
          },
          "datasource": {
            "type": "grafana-azure-monitor-datasource",
            "uid": "${DS_AZURE_MONITOR}"
          },
          "queryType": "Azure Log Analytics",
          "refId": "A"
        }
      ],
      "title": "GraphApi throttled by AppID",
      "type": "table"
    },
    {
      "datasource": {
        "type": "datasource",
        "uid": "-- Dashboard --"
      },
      "fieldConfig": {
        "defaults": {
          "color": {
            "mode": "palette-classic"
          },
          "custom": {
            "axisBorderShow": false,
            "axisCenteredZero": false,
            "axisColorMode": "text",
            "axisLabel": "",
            "axisPlacement": "auto",
            "barAlignment": 0,
            "barWidthFactor": 0.6,
            "drawStyle": "points",
            "fillOpacity": 0,
            "gradientMode": "none",
            "hideFrom": {
              "legend": false,
              "tooltip": false,
              "viz": false
            },
            "insertNulls": false,
            "lineInterpolation": "smooth",
            "lineWidth": 1,
            "pointSize": 5,
            "scaleDistribution": {
              "type": "linear"
            },
            "showPoints": "auto",
            "spanNulls": false,
            "stacking": {
              "group": "A",
              "mode": "none"
            },
            "thresholdsStyle": {
              "mode": "off"
            }
          },
          "fieldMinMax": false,
          "mappings": [],
          "min": 0,
          "thresholds": {
            "mode": "absolute",
            "steps": [
              {
                "color": "green"
              },
              {
                "color": "red",
                "value": 80
              }
            ]
          },
          "unit": "dtdurationms"
        },
        "overrides": []
      },
      "gridPos": {
        "h": 9,
        "w": 23,
        "x": 0,
        "y": 11
      },
      "id": 2,
      "options": {
        "legend": {
          "calcs": [],
          "displayMode": "list",
          "placement": "bottom",
          "showLegend": true
        },
        "tooltip": {
          "hideZeros": false,
          "mode": "single",
          "sort": "none"
        }
      },
      "pluginVersion": "11.6.2",
      "targets": [
        {
          "datasource": {
            "type": "datasource",
            "uid": "-- Dashboard --"
          },
          "panelId": 1,
          "refId": "A"
        }
      ],
      "title": "GraphApi Responce Duration Ms",
      "transformations": [
        {
          "id": "filterFieldsByName",
          "options": {
            "include": {
              "names": [
                "TimeGenerated",
                "DurationMs",
                "AppId",
                "TenantId",
                "Location",
                "Type",
                "SourceSystem",
                "ClientAuthMethod",
                "IdentityProvider",
                "ServicePrincipalId",
                "UserId",
                "AadTenantId",
                "RequestMethod",
                "ClientRequestId",
                "OperationId",
                "RequestId",
                "UserAgent",
                "Roles"
              ]
            }
          }
        },
        {
          "id": "groupingToMatrix",
          "options": {
            "columnField": "AppId",
            "emptyValue": "empty",
            "rowField": "TimeGenerated",
            "valueField": "DurationMs"
          }
        }
      ],
      "type": "timeseries"
    },
    {
      "datasource": {
        "type": "grafana-azure-monitor-datasource",
        "uid": "${DS_AZURE_MONITOR}"
      },
      "fieldConfig": {
        "defaults": {
          "color": {
            "mode": "thresholds"
          },
          "mappings": [],
          "thresholds": {
            "mode": "absolute",
            "steps": [
              {
                "color": "green"
              },
              {
                "color": "red",
                "value": 80
              }
            ]
          }
        },
        "overrides": []
      },
      "gridPos": {
        "h": 9,
        "w": 23,
        "x": 0,
        "y": 20
      },
      "id": 7,
      "options": {
        "displayMode": "gradient",
        "legend": {
          "calcs": [],
          "displayMode": "list",
          "placement": "bottom",
          "showLegend": false
        },
        "maxVizHeight": 300,
        "minVizHeight": 16,
        "minVizWidth": 8,
        "namePlacement": "auto",
        "orientation": "horizontal",
        "reduceOptions": {
          "calcs": [
            "sum"
          ],
          "fields": "/^Count$/",
          "values": true
        },
        "showUnfilled": true,
        "sizing": "auto",
        "text": {},
        "valueMode": "text"
      },
      "pluginVersion": "11.6.2",
      "targets": [
        {
          "azureLogAnalytics": {
            "basicLogsQuery": false,
            "dashboardTime": true,
            "query": "MicrosoftGraphActivityLogs\r\n| where AppId in (${AppId})\r\n| extend UriPath = tostring(parse_url(RequestUri).Path)\r\n| summarize Count = count() by UriPath\r\n| order by Count\r\n",
            "resources": [
              "${LogAnalyticsWorkspaces}"
            ],
            "resultFormat": "logs",
            "timeColumn": "TimeGenerated"
          },
          "datasource": {
            "type": "grafana-azure-monitor-datasource",
            "uid": "${DS_AZURE_MONITOR}"
          },
          "queryType": "Azure Log Analytics",
          "refId": "A"
        }
      ],
      "title": "GraphApi calls by Path",
      "type": "bargauge"
    },
    {
      "datasource": {
        "type": "grafana-azure-monitor-datasource",
        "uid": "${DS_AZURE_MONITOR}"
      },
      "fieldConfig": {
        "defaults": {
          "color": {
            "mode": "palette-classic"
          },
          "custom": {
            "axisBorderShow": false,
            "axisCenteredZero": false,
            "axisColorMode": "text",
            "axisLabel": "",
            "axisPlacement": "auto",
            "fillOpacity": 80,
            "gradientMode": "none",
            "hideFrom": {
              "legend": false,
              "tooltip": false,
              "viz": false
            },
            "lineWidth": 1,
            "scaleDistribution": {
              "type": "linear"
            },
            "thresholdsStyle": {
              "mode": "off"
            }
          },
          "mappings": [],
          "thresholds": {
            "mode": "absolute",
            "steps": [
              {
                "color": "green"
              }
            ]
          }
        },
        "overrides": []
      },
      "gridPos": {
        "h": 9,
        "w": 23,
        "x": 0,
        "y": 29
      },
      "id": 12,
      "options": {
        "barRadius": 0,
        "barWidth": 0.97,
        "fullHighlight": false,
        "groupWidth": 0.7,
        "legend": {
          "calcs": [],
          "displayMode": "list",
          "placement": "bottom",
          "showLegend": true
        },
        "orientation": "vertical",
        "showValue": "auto",
        "stacking": "normal",
        "tooltip": {
          "hideZeros": false,
          "mode": "single",
          "sort": "none"
        },
        "xField": "TimeGenerated\\AppId",
        "xTickLabelRotation": 0,
        "xTickLabelSpacing": 100
      },
      "pluginVersion": "11.6.2",
      "targets": [
        {
          "azureLogAnalytics": {
            "basicLogsQuery": false,
            "dashboardTime": true,
            "query": "MicrosoftGraphActivityLogs\r\n| where AppId in (${AppId})\r\n| summarize Count = count() by AppId , bin(TimeGenerated, 5m)\r\n| order by TimeGenerated asc  ",
            "resources": [
              "${LogAnalyticsWorkspaces}"
            ],
            "resultFormat": "logs",
            "timeColumn": "TimeGenerated"
          },
          "datasource": {
            "type": "grafana-azure-monitor-datasource",
            "uid": "${DS_AZURE_MONITOR}"
          },
          "queryType": "Azure Log Analytics",
          "refId": "A"
        }
      ],
      "title": "GraphApi calls by AppId",
      "transformations": [
        {
          "id": "groupingToMatrix",
          "options": {
            "columnField": "AppId",
            "emptyValue": "null",
            "rowField": "TimeGenerated",
            "valueField": "Count"
          }
        }
      ],
      "type": "barchart"
    },
    {
      "datasource": {
        "type": "grafana-azure-monitor-datasource",
        "uid": "${DS_AZURE_MONITOR}"
      },
      "fieldConfig": {
        "defaults": {
          "color": {
            "mode": "palette-classic-by-name"
          },
          "custom": {
            "axisBorderShow": false,
            "axisCenteredZero": false,
            "axisColorMode": "text",
            "axisGridShow": true,
            "axisLabel": "Count",
            "axisPlacement": "auto",
            "fillOpacity": 80,
            "gradientMode": "none",
            "hideFrom": {
              "legend": false,
              "tooltip": false,
              "viz": false
            },
            "lineWidth": 1,
            "scaleDistribution": {
              "type": "linear"
            },
            "thresholdsStyle": {
              "mode": "off"
            }
          },
          "mappings": [],
          "min": 0,
          "thresholds": {
            "mode": "absolute",
            "steps": [
              {
                "color": "green"
              }
            ]
          },
          "unit": "none"
        },
        "overrides": []
      },
      "gridPos": {
        "h": 9,
        "w": 23,
        "x": 0,
        "y": 38
      },
      "id": 8,
      "options": {
        "barRadius": 0,
        "barWidth": 0.97,
        "fullHighlight": false,
        "groupWidth": 0.7,
        "legend": {
          "calcs": [],
          "displayMode": "list",
          "placement": "bottom",
          "showLegend": true
        },
        "orientation": "auto",
        "showValue": "auto",
        "stacking": "normal",
        "tooltip": {
          "hideZeros": false,
          "mode": "multi",
          "sort": "none"
        },
        "xField": "TimeGenerated\\ResponseStatusCode",
        "xTickLabelRotation": 0,
        "xTickLabelSpacing": 100
      },
      "pluginVersion": "11.6.2",
      "targets": [
        {
          "azureLogAnalytics": {
            "basicLogsQuery": false,
            "dashboardTime": true,
            "query": "MicrosoftGraphActivityLogs\r\n| where AppId in (${AppId})\r\n| summarize Count = count() by ResponseStatusCode , bin(TimeGenerated, 5m)\r\n| project TimeGenerated , ResponseStatusCode , Count\r\n| order by TimeGenerated asc  ",
            "resources": [
              "${LogAnalyticsWorkspaces}"
            ],
            "resultFormat": "time_series",
            "timeColumn": "TimeGenerated"
          },
          "datasource": {
            "type": "grafana-azure-monitor-datasource",
            "uid": "${DS_AZURE_MONITOR}"
          },
          "queryType": "Azure Log Analytics",
          "refId": "A"
        }
      ],
      "title": "GraphApi ResponseStatusCode",
      "transformations": [
        {
          "id": "groupingToMatrix",
          "options": {
            "columnField": "ResponseStatusCode",
            "emptyValue": "zero",
            "rowField": "TimeGenerated",
            "valueField": "Count"
          }
        }
      ],
      "type": "barchart"
    },
    {
      "datasource": {
        "type": "grafana-azure-monitor-datasource",
        "uid": "${DS_AZURE_MONITOR}"
      },
      "fieldConfig": {
        "defaults": {
          "color": {
            "mode": "thresholds"
          },
          "custom": {
            "align": "auto",
            "cellOptions": {
              "type": "auto"
            },
            "filterable": true,
            "inspect": false
          },
          "mappings": [],
          "thresholds": {
            "mode": "absolute",
            "steps": [
              {
                "color": "green"
              },
              {
                "color": "red",
                "value": 80
              }
            ]
          }
        },
        "overrides": [
          {
            "matcher": {
              "id": "byName",
              "options": "RequestUri"
            },
            "properties": [
              {
                "id": "custom.width",
                "value": 492
              }
            ]
          },
          {
            "matcher": {
              "id": "byName",
              "options": "Scopes"
            },
            "properties": [
              {
                "id": "custom.width",
                "value": 674
              }
            ]
          },
          {
            "matcher": {
              "id": "byName",
              "options": "ParsedUri"
            },
            "properties": [
              {
                "id": "custom.width",
                "value": 890
              }
            ]
          }
        ]
      },
      "gridPos": {
        "h": 15,
        "w": 23,
        "x": 0,
        "y": 47
      },
      "id": 1,
      "options": {
        "cellHeight": "sm",
        "footer": {
          "countRows": false,
          "enablePagination": true,
          "fields": "",
          "reducer": [
            "sum"
          ],
          "show": false
        },
        "showHeader": true,
        "sortBy": []
      },
      "pluginVersion": "11.6.2",
      "targets": [
        {
          "azureLogAnalytics": {
            "dashboardTime": true,
            "query": "// Combine all sign-in tables into one set\r\nlet SignInApps = \r\n    union isfuzzy=true\r\n        (AADNonInteractiveUserSignInLogs | project AppId, AppDisplayName),\r\n        (AADManagedIdentitySignInLogs    | project AppId, ServicePrincipalName),\r\n        (AADServicePrincipalSignInLogs   | project AppId, ServicePrincipalName)\r\n    | summarize AppDisplayName = any(AppDisplayName), ServicePrincipalName = any(ServicePrincipalName) by AppId;\r\nMicrosoftGraphActivityLogs\r\n| where AppId in (${AppId})\r\n| join kind=leftouter SignInApps on AppId\r\n| extend ParsedUri = parse_url(RequestUri)\r\n| extend Path = tostring(ParsedUri.Path)\r\n| extend applicationName = strcat(AppDisplayName, ServicePrincipalName)\r\n//| extend PreviousTimeGenerated = next(TimeGenerated)\r\n//| extend IngestDelayInMs = datetime_diff('millisecond', TimeGenerated, PreviousTimeGenerated)",
            "resources": [
              "${LogAnalyticsWorkspaces}"
            ],
            "resultFormat": "logs",
            "timeColumn": "TimeGenerated"
          },
          "datasource": {
            "type": "grafana-azure-monitor-datasource",
            "uid": "${DS_AZURE_MONITOR}"
          },
          "hide": false,
          "queryType": "Azure Log Analytics",
          "refId": "A"
        },
        {
          "azureLogAnalytics": {
            "dashboardTime": true,
            "query": "MicrosoftGraphActivityLogs\r\n| where AppId in (${AppId})\r\n| join AADServicePrincipalSignInLogs on AppId\r\n| order by TimeGenerated desc\r\n| extend PreviousTimeGenerated = next(TimeGenerated)\r\n| extend IngestDelayInMs = datetime_diff('millisecond', TimeGenerated, PreviousTimeGenerated)",
            "resources": [
              "${LogAnalyticsWorkspaces}"
            ],
            "resultFormat": "logs",
            "timeColumn": "TimeGenerated"
          },
          "datasource": {
            "type": "grafana-azure-monitor-datasource",
            "uid": "${DS_AZURE_MONITOR}"
          },
          "hide": true,
          "queryType": "Azure Log Analytics",
          "refId": "B"
        },
        {
          "azureLogAnalytics": {
            "dashboardTime": true,
            "query": "MicrosoftGraphActivityLogs\r\n| where AppId in (${AppId})\r\n| order by TimeGenerated desc\r\n| extend PreviousTimeGenerated = next(TimeGenerated)\r\n| extend IngestDelayInMs = datetime_diff('millisecond', TimeGenerated, PreviousTimeGenerated)",
            "resources": [
              "${LogAnalyticsWorkspaces}"
            ],
            "resultFormat": "logs",
            "timeColumn": "TimeGenerated"
          },
          "datasource": {
            "type": "grafana-azure-monitor-datasource",
            "uid": "${DS_AZURE_MONITOR}"
          },
          "hide": true,
          "queryType": "Azure Log Analytics",
          "refId": "C"
        }
      ],
      "title": "Graph API RAW Log",
      "type": "table"
    },
    {
      "collapsed": false,
      "gridPos": {
        "h": 1,
        "w": 24,
        "x": 0,
        "y": 62
      },
      "id": 5,
      "panels": [],
      "title": "LogAnalytics Diagnostic Data collection insights",
      "type": "row"
    },
    {
      "datasource": {
        "type": "grafana-azure-monitor-datasource",
        "uid": "${DS_AZURE_MONITOR}"
      },
      "description": "Diagnostics LAW Ingest Delay",
      "fieldConfig": {
        "defaults": {
          "color": {
            "mode": "thresholds"
          },
          "fieldMinMax": false,
          "mappings": [],
          "max": 300000,
          "min": 0,
          "thresholds": {
            "mode": "absolute",
            "steps": [
              {
                "color": "green"
              }
            ]
          },
          "unit": "dtdurationms"
        },
        "overrides": []
      },
      "gridPos": {
        "h": 7,
        "w": 5,
        "x": 1,
        "y": 63
      },
      "id": 4,
      "options": {
        "minVizHeight": 75,
        "minVizWidth": 75,
        "orientation": "auto",
        "reduceOptions": {
          "calcs": [
            "lastNotNull"
          ],
          "fields": "/^LastIngestionRecordDeplyMs$/",
          "values": false
        },
        "showThresholdLabels": false,
        "showThresholdMarkers": true,
        "sizing": "auto"
      },
      "pluginVersion": "11.6.2",
      "targets": [
        {
          "azureLogAnalytics": {
            "dashboardTime": false,
            "query": "MicrosoftGraphActivityLogs\r\n| order by TimeGenerated desc\r\n| take 1\r\n| extend LastIngestionRecordDeplyMs = datetime_diff('millisecond', now(), TimeGenerated)\r\n| project LastIngestionRecordDeplyMs",
            "resources": [
              "${LogAnalyticsWorkspaces}"
            ],
            "resultFormat": "logs"
          },
          "datasource": {
            "type": "grafana-azure-monitor-datasource",
            "uid": "${DS_AZURE_MONITOR}"
          },
          "queryType": "Azure Log Analytics",
          "refId": "A"
        }
      ],
      "title": "Last data update processed ago",
      "type": "gauge"
    },
    {
      "datasource": {
        "type": "grafana-azure-monitor-datasource",
        "uid": "${DS_AZURE_MONITOR}"
      },
      "fieldConfig": {
        "defaults": {
          "color": {
            "mode": "palette-classic"
          },
          "custom": {
            "axisBorderShow": false,
            "axisCenteredZero": false,
            "axisColorMode": "text",
            "axisLabel": "",
            "axisPlacement": "auto",
            "barAlignment": 0,
            "barWidthFactor": 0.6,
            "drawStyle": "line",
            "fillOpacity": 0,
            "gradientMode": "none",
            "hideFrom": {
              "legend": false,
              "tooltip": false,
              "viz": false
            },
            "insertNulls": false,
            "lineInterpolation": "linear",
            "lineWidth": 1,
            "pointSize": 5,
            "scaleDistribution": {
              "type": "linear"
            },
            "showPoints": "auto",
            "spanNulls": false,
            "stacking": {
              "group": "A",
              "mode": "none"
            },
            "thresholdsStyle": {
              "mode": "off"
            }
          },
          "mappings": [],
          "thresholds": {
            "mode": "absolute",
            "steps": [
              {
                "color": "green"
              },
              {
                "color": "red",
                "value": 80
              }
            ]
          },
          "unit": "dtdurationms"
        },
        "overrides": []
      },
      "gridPos": {
        "h": 8,
        "w": 22,
        "x": 1,
        "y": 70
      },
      "id": 3,
      "options": {
        "legend": {
          "calcs": [],
          "displayMode": "list",
          "placement": "bottom",
          "showLegend": true
        },
        "tooltip": {
          "hideZeros": false,
          "mode": "single",
          "sort": "none"
        }
      },
      "pluginVersion": "11.6.2",
      "targets": [
        {
          "azureLogAnalytics": {
            "dashboardTime": true,
            "query": "MicrosoftGraphActivityLogs\r\n| order by TimeGenerated desc\r\n| extend LastIngestionRecordDeplyMs = datetime_diff('millisecond', now(), TimeGenerated)\r\n| project TimeGenerated,LastIngestionRecordDeplyMs",
            "resources": [
              "${LogAnalyticsWorkspaces}"
            ],
            "resultFormat": "logs",
            "timeColumn": "TimeGenerated"
          },
          "datasource": {
            "type": "grafana-azure-monitor-datasource",
            "uid": "${DS_AZURE_MONITOR}"
          },
          "hide": true,
          "queryType": "Azure Log Analytics",
          "refId": "A"
        }
      ],
      "title": "Diagnostics LAW Ingest Delay In Ms",
      "type": "timeseries"
    }
  ],
  "schemaVersion": 41,
  "tags": [],
  "templating": {
    "list": [
      {
        "current": {},
        "definition": "",
        "name": "subscriptions",
        "options": [],
        "query": {
          "azureLogAnalytics": {
            "query": "",
            "resources": []
          },
          "queryType": "Azure Subscriptions",
          "refId": "A"
        },
        "refresh": 1,
        "regex": "",
        "type": "query"
      },
      {
        "current": {},
        "definition": "",
        "label": "LogAnalyticsWorkspaces",
        "name": "LogAnalyticsWorkspaces",
        "options": [],
        "query": {
          "azureLogAnalytics": {
            "query": "",
            "resources": []
          },
          "queryType": "Azure Workspaces",
          "refId": "A",
          "subscription": "$subscriptions"
        },
        "refresh": 1,
        "regex": "",
        "type": "query"
      },
      {
        "current": {},
        "definition": "",
        "includeAll": true,
        "multi": true,
        "name": "AppId",
        "options": [],
        "query": {
          "azureLogAnalytics": {
            "query": "MicrosoftGraphActivityLogs\r\n| distinct AppId\r\n| project AppId\r\n",
            "resources": [
              "${LogAnalyticsWorkspaces}"
            ]
          },
          "queryType": "Azure Log Analytics",
          "refId": "A"
        },
        "refresh": 1,
        "regex": "",
        "type": "query"
      }
    ]
  },
  "time": {
    "from": "now-1h",
    "to": "now"
  },
  "timepicker": {},
  "timezone": "",
  "title": "GraphAPI-Dashboard",
  "uid": "subscriptions~d4b3c7e3-4e51-4b1c-ba37-eac48affcd8a~resourceGroups~GrafanaDashboards~providers~Microsoft.Dashboard~dashboards~GraphAPI-Dashboard",
  "version": 73,
  "weekStart": ""
}
